# Задача 2: Сложение двух чисел
# Напишите программу, которая запрашивает у пользователя два числа и выводит их сумму.
# Пример:
# Ввод: 3, 5
# Вывод: Сумма: 8
print("Write 2 numbers to get the summ of them")
b=float(input())
c=float(input())
d=b+c
print(d)