# Задача 10: Уравнение прямой
# Напишите программу, которая находит значение y в уравнении прямой y = kx + b для заданных x, k и b.
# Пример:
# Ввод: k = 2, b = 3, x = 5
# Вывод: y = 13
print("Write 3 numbers")
k=float(input())
b=float(input())
x=float(input())
a=k*x+b
print(a)

