# Задача 8: Число в квадрате и кубе
# Напишите программу, которая запрашивает у пользователя число и выводит его квадрат и куб.
# Пример:
# Ввод: 5
# Вывод: Квадрат: 25, Куб: 125
print("Write a number")
a=float(input())
b=a**2
c=a**3
print("The square is", b)
print("The cube is", c)